Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: RequestedCapacity does not include the internal zero terminator.
ja: RequestedCapacityには内部ゼロターミネータは含まれない。

source: Slow takes precedence over Alt, so there is no need to specify Alt in this case.
ja: Slowは Altより優先されるので、この場合はAltを指定する必要はありません。

source: Thrown is a continuable runtime error.
ja: Thrownは継続可能なランタイムエラーです。

source: Thrown is a critical runtime error, such as corruption detected by DllCall.
ja: DllCallで検出された破損などの重大なランタイムエラーが発生した場合、スローされます。

source: Thrown is a non-continuable runtime error or a value thrown by the script.
ja: Thrownは、継続不可能なランタイムエラーまたはスクリプトによってスローされる値です。

source: VK and SC are integers.
ja: VKと SCは整数です。

source: ; Check if the last character of the folder name is a backslash, which happens for root
ja: ; フォルダ名の最後の文字がバックスラッシュであるかどうかをチェックします。

source: ; Calculate buffer size required for SHFILEINFO structure.
ja: ; SHFILEINFO構造体に必要なバッファサイズを計算する。

source: ; Gather a list of file names from the selected folder and append them to the ListView:
ja: ; 選択されたフォルダーからファイル名のリストを収集し、ListViewに追加する：

source: ; Build a unique extension ID to avoid characters that are illegal in variable names,
ja: ; 変数名に不正な文字が含まれないように、ユニークな拡張IDを構築する、

source: ; Upon success, Show file name in title bar (in case we were called by MenuFileSaveAs):
ja: ; 成功したら、タイトルバーにファイル名を表示する（MenuFileSaveAsから呼び出された場合のため）：

source: ; Assign a hotkey to activate this group, which traverses
ja: ; このグループを起動するためのホットキーを割り当てます。

source: ; Calculate the position of the delimiter at the end of this field.
ja: ; このフィールドの末尾にあるデリミタの位置を計算します。

source: ; Create another menu destined to become a submenu of the above menu.
ja: ; 上のメニューのサブメニューとなるような別のメニューを作成する。

source: ; Create some buttons:
ja: ; いくつかのボタンを作成します：

source: ; Create the submenus for the menu bar:
ja: ; メニューバーのサブメニューを作成する：

source: ; Do nothing.
ja: ; 何もしません。

source: ; If this happens, edit the path on the Loop line above.
ja: ; このような場合は、上記のLoop行のパスを編集してください。

source: ; Notify the script whenever the user double clicks a row:
ja: ; ユーザーが行をダブルクリックするたびに、スクリプトに通知する：

source: ; Send the request. Ready() will be called when it's complete.
ja: ; リクエストを送信します。 完了したらReady()が呼ばれる。

source: Alpha is an ordinary variable, and could be replaced with a function call or some other sub-expression which returns an object.
ja: Alphaは普通の変数で、関数呼び出しや、オブジェクトを返す他の部分式に置き換えることができる。

source: ControlColor (the second parameter) is not supported, but all controls which previously supported it can have a background set by the +Background option instead.
ja: ControlColor（第2パラメータ）はサポートされていませんが、以前サポートしていたすべてのコントロールは、代わりに+Backgroundオプションで背景を設定することができます。

source: Function must be an object with a call method taking one parameter, the name of the hotkey.
ja: 関数は、ホットキーの名前は1つのパラメータとする呼び出しメソッドを持つオブジェクトでなければなりません。

source: Logical and Case are currently mutually exclusive:
ja: Logicalと Caseは現在相互排他的です：

source: Logical and Case are currently mutually exclusive: only the one most recently specified will be in effect.
ja: Logicalと Caseは現在相互排他的です：直近で指定されたものだけが有効になります。

source: NewText cannot be an array, but if multiple items match, they are all selected.
ja: NewTextは配列にはできませんが、複数の項目が一致した場合、すべて選択されます。

source: Pairs can contain lines without an equal sign (=), but this may produce inconsistent results.
ja: ペアには、等号（=）を含まない行を含めることができますが、この場合、結果に矛盾が生じることがあります。

source: Params must be a variable or sub-expression which returns an Array or other enumerable object.
ja: Paramsは、Arrayまたは他の列挙可能なオブジェクトを返す変数または部分式でなければなりません。

source: Precision specifies the maximum number of significant digits.
ja: Precisionは、最大有効桁数を指定します。

source: ; Otherwise, the window has been resized or maximized. Resize the Edit control to match.
ja: ; それ以外の場合は、ウィンドウのサイズが変更されたり、最大化されたりしています。それに合わせてEditコントロールのサイズを変更します。

source: ; Derive a Unique ID by assigning a different bit position to each character:
ja: ; 各文字に異なるビット位置を割り当てることで、ユニークなIDを導出する：

source: ; Check if this file extension already has an icon in the ImageLists. If it does,
ja: ; このファイル拡張子がすでにImageListsにアイコンを持っているかどうかをチェックします。もしそうであれば

source: ; Get the high-quality small-icon associated with this file extension:
ja: ; このファイル拡張子に関連する高品質のスモールアイコンを入手することができます：

source: ; Add the picture control, preserving the aspect ratio of the first picture.
ja: ; ピクチャーコントロールを追加し、1枚目のピクチャーのアスペクト比を保持します。

source: ; Assign a hotkey to visit each Outlook window, one at a time.
ja: ; Outlookの各ウィンドウを一度に訪問するためのホットキーを割り当てます。

source: ; Create a submenu in the first menu (a right-arrow indicator). When the user selects it, the second menu is displayed.
ja: ; 最初のメニューにサブメニューを作成する（右矢印の表示）。ユーザーが選択すると、2番目のメニューが表示される。

source: ; Create the ListView and its columns via MyGui.Add:
ja: ; MyGui.AddでListViewとそのカラムを作成します：

source: ; For this example, the menu items don't do anything.
ja: ; この例では、メニュー項目は何もしません。

source: ; Gather a list of file names from a folder and put them into the ListView:
ja: ; フォルダからファイル名のリストを集め、ListViewに入れる：

source: ; Note: I believe HKEY_CURRENT_USER does not need to be searched if HKEY_USERS is
ja: 注：HKEY_USERSが設定されている場合は、HKEY_CURRENT_USERを検索する必要はないと思います。

source: ; Retrieve the delimiter found by the parsing loop.
ja: ; 解析ループで見つかったデリミターを取得します。

source: ; Run some websites:
ja: ; ウェブサイトを開きます：

source: LibName cannot contain variable references.
ja: LibNameに変数参照を含めることはできません。

source: Precision specifies the number of digits after the decimal point.
ja: Precisionは、小数点以下の桁数を指定します。

source: SourceCode is an approximation of the source code at that line, as it would be shown in ListLines.
ja: SourceCodeは、ListLinesに表示されるような、その行のソースコードの近似値です。

source: ; Extract the hIcon member from the structure:
ja: ; 構造体からhIconメンバを抽出する：

source: ; Add the HICON directly to the small-icon and large-icon lists.
ja: ; HICONを直接スモールアイコン、ラージアイコンリストに追加する。

source: ; Now that it's been copied into the ImageLists, the original should be destroyed:
ja: ; ImageListsにコピーされたので、オリジナルは破棄してください：

source: ; Cache the icon to save memory and improve loading performance:
ja: ; アイコンをキャッシュしてメモリを節約し、読み込みのパフォーマンスを向上させます：

source: ; Create the new row in the ListView and assign it the icon number determined above:
ja: ; リストビューに新しい行を作成し、上記で決定したアイコン番号を割り当てる：

source: ; Create the menu bar by attaching the submenus to it:
ja: ; サブメニューをくっつけてメニューバーを作成する：

source: ; Switch pictures!
ja: ; 写真を切り替えます！

source: ComObj's variant type must be VT_DISPATCH or VT_UNKNOWN, and the object must implement the IProvideClassInfo interface (some objects do not).
ja: ComObjのバリアントタイプはVT_DISPATCHまたはVT_UNKNOWNでなければならず、オブジェクトはIProvideClassInfoインターフェースを実装しなければならない（実装していないオブジェクトもある）。

source: ComObj's variant type must be VT_DISPATCH.
ja: ComObjのバリアントタイプはVT_DISPATCHでなければならない。

source: Methods are properties which can be called.
ja: メソッドは、呼び出すことができるプロパティである。

source: MyFunction would be called only for the ItemFocus event.
ja: MyFunctionは、ItemFocusイベントに対してのみ呼び出されることになります。

source: Norm returns the font to normal weight/boldness and turns off italic, strike, and underline (but it retains the existing color and size).
ja: Normは、フォントを通常のウェイト/太さに戻し、イタリック、ストライク、アンダーラインをオフにします（ただし、既存の色とサイズは保持されます）。

source: ; Create the popup menu to be used as the context menu:
ja: ; コンテキストメニューとして使用するポップアップメニューを作成します：

source: ; Attach the menu bar to the window:
ja: ; メニューバーをウィンドウに貼り付ける：

source: ; Press Pause to continue.
ja: ; 続けるにはPauseボタンを押してください。

source: ; Replace CRLF and/or LF with `n for use in a "send-raw" hotstring:
ja: ; CRLFやLFを`nに置き換えて、「send-raw」ホットストリングで使用することができます：

source: Value must be 0, 1 or -1.
ja: Valueは、0、1または-1でなければならない。

source: value is converted to the appropriate type (following COM conventions), instead of requiring an integer with the right binary value.
ja: 値は、正しいバイナリ値を持つ整数を必要とするのではなく、（COMの規約に従って）適切な型に変換されます。

source: ; Since deleting a row reduces the RowNumber of all other rows beneath it,
ja: ; 行を削除すると、その下にある他のすべての行のRowNumberが減少するためです、

source: ; Otherwise, the window has been resized or maximized. Resize the ListView to match.
ja: ; それ以外の場合は、ウィンドウがリサイズまたは最大化されたことを意味します。それに合わせてListViewのサイズを変更します。

source: ; Create the main Edit control:
ja: ; メインのEditコントロールを作成します：

source: ; Otherwise, extract this URL:
ja: ; そうでない場合は、このURLを抽出します：

source: Class must be an Object with a Prototype own property, but typically the property is defined implicitly by a class definition.
ja: Classは、プロトタイプ自身のプロパティを持つオブジェクトでなければなりませんが、通常、プロパティはクラス定義によって暗黙的に定義されます。

source: ; Apply events:
ja: ; イベントを適用します：

source: ; Create an ImageList so that the ListView can display some icons:
ja: ; ListViewにアイコンを表示できるように、ImageListを作成する：

source: ; This is the OnError callback function. 'errors' is given a value via Bind().
ja: ; これはOnErrorコールバック関数である。'errors' には Bind() で値を与えます。

source: ; This will move the input box's caret to a more friendly position:
ja: ; 入力ボックスのキャレットを、より使いやすい位置に移動させます：

source: DownTemp and DownR can be used to override this behavior.
ja: DownTempと DownRを使用すると、この動作をオーバーライドすることができます。

source: ; Show the input box, providing the default hotstring:
ja: ; 入力ボックスを表示し、デフォルトのホットストリングを提供します：

source: "So, how exactly does a person such as myself create a hotkey?" Good question.
ja: 「では、私のような素人がホットキーを作るにはどうすればいいのでしょうか？」いい質問です。

source: (Optional) A number (1-9) specifying the number of extra results to be returned.
ja: (オプション）返す追加結果の数を指定する数値（1～9）。

source: (Optional) Any text, which is ignored.
ja: (オプショナル）任意のテキスト 。

source: (Optional) If set to 1, any errors that occur during the launching or running of the program will not be reported to the user.
ja: (オプション）1に設定すると、プログラムの起動中または実行中に発生したエラーは、ユーザーに報告されない。

source: (Optional) If set to 1, the program will be launched hidden.
ja: (オプション)1に設定すると、プログラムは隠れて起動する。

source: (Optional) Leave blank to execute before any Compression is done.
ja: (オプション) 圧縮が実行される前に実行する場合は空白のままにします。

source: (Optional) Overrides the default codepage used to process script files.
ja: (オプション) スクリプトファイルの処理に使われるデフォルトのコードページを上書きする。

source: (Optional) Set to 1 to make UIAccess true in the manifest.
ja: (オプション) マニフェストでUIAccessをtrueにするには1を設定します。

source: (Optional) The file name to be given to the .exe.
ja: (オプション).exeに付けるファイル名。

source: (Optional) The icon file to use.
ja: (オプション）使用するアイコンファイル。

source: (Optional) The name that the resource will have (can be a string or an integer).
ja: (オプション)リソースの名前（文字列または整数）。

source: (Optional) The name to be set in the manifest.
ja: (オプション)マニフェストに設定する名前。

source: (Optional) The version to be set in the manifest.
ja: (オプション)マニフェストに設定するバージョン。

source: (Optional) The working directory for the program.
ja: (オプション）プログラムの作業ディレクトリ。

source: Append: Creates a new file if the file didn't exist, otherwise moves the file pointer to the end of the file.
ja: Append：ファイルが存在しない場合は新しいファイルを作成し、それ以外の場合はファイルポインタをファイルの末尾に移動します。

source: Call: Throw a MethodError.
ja: Call：MethodErrorをスローします。

source: Capacity is the variable's current capacity.
ja: Capacityは、その変数の現在の容量です。

source: Distance must be zero or greater.
ja: 距離は、0以上でなければならない。

source: Distance should usually be negative.
ja: 距離は、通常、マイナスになるはずです。

source: Get: Throw a PropertyError.
ja: Get：PropertyErrorをスローします。

source: Info depends on the type of object, but is currently very limited.
ja: Infoはオブジェクトの種類によって異なりますが、現在は非常に限られています。

source: Params corresponds to whatever parameters the event has.
ja: Paramsは、イベントが持つあらゆるパラメータに対応します。

source: Prefix should be the same as the PrefixOrSink parameter if it is a string; otherwise, it should be omitted.
ja: Prefixは、文字列の場合はPrefixOrSinkパラメータと同じでなければならず、それ以外の場合は省略します。

source: Ptr can also be used with the * or P suffix; it should be used with functions that output a pointer via LPVOID* or similar.
ja: Ptrは接尾辞に*やPを付けて使うこともできます。LPVOID*などを使ってポインタを出力する関数と一緒に使う必要があります。

source: Read/Write: Creates a new file if the file didn't exist.
ja: Read/Write：ファイルが存在しなかった場合、新しいファイルを作成します。

source: Read: Fails if the file doesn't exist.
ja: Read：ファイルが存在しない場合、失敗します。

source: SERVER and PORT may be omitted.
ja: SERVERと PORTは省略できる。

source: Set: Define a new property with the given value, such as by calling DefineProp.
ja: Set：DefinePropを呼び出すなどして、指定された値を持つ新しいプロパティを定義する。

source: String is the first 60 characters of the variable's string value.
ja: Stringは、変数の文字列値の最初の60文字です。

source: UPtr is also valid, but is only unsigned in 32-bit builds as AutoHotkey does not support unsigned 64-bit integers.
ja: UPtrも有効ですが、AutoHotkeyは符号なし64ビット整数をサポートしていないため、32ビットビルドでは符号なしのみです。

source: Until can be used with any Loop or For.
ja: Untilは、どんなループやForでも使える。

source: Write: Creates a new file, overwriting any existing file.
ja: Write：新しいファイルを作成し、既存のファイルを上書きします。

source: Ptr should be used for pointers to arrays or structures (such as RECT* or LPPOINT) and almost all handles (such as HWND, HBRUSH or HBITMAP).
ja: Ptrは、配列や構造体へのポインタ（RECT*やLPPOINTなど）や、ほとんどすべてのハンドル（HWND、HBRUSH、HBITMAPなど）に使用する必要があります。

source: ComObj is an additional parameter containing a reference to the original wrapper object which was passed to ComObjConnect; it is never included in the COM event's documentation.
ja: ComObjは、ComObjConnectに渡されたオリジナルのラッパー・オブジェクトへの参照を含む追加パラメータです。

source: HWND can be the HWND of any window, even one not owned by the script.
ja: HWNDには、スクリプトが所有していないウィンドウのHWNDも指定することができます。

source: funcObj}).
ja: funcObj})と同じ型のプロパティを作成する。

source: ... event-handling code ...
ja: ...イベント処理コード...

source: * (multiplication)
ja: *（乗算）

source: * (numpad multiplication)
ja: *（テンキーの乗算）

source: + (addition)
ja: +（加算）

source: + (numpad addition)
ja: +（テンキーの加算）

source: - (numpad subtraction)
ja: -（テンキーの減算）

source: - (subtraction)
ja: -（減算）

source: . (numpad period) (as seen when NumLock is ON).
ja: .（テンキー期間）（NumLockがONの時に見られる）。

source: / (division)
ja: /（除算）

source: / (numpad division)
ja: /（テンキーの除算）

source: 5 / typically does nothing
ja: 5 / 通常は何もしません

source: Alt (technical info:
ja: Alt（技術情報：

source: Alt (technical info: sends the neutral virtual key but the left scan code)
ja: Alt（技術情報：はニュートラルバーチャルキーを送信しますが、左のスキャンコード）

source: Alt is not masked if Ctrl was down when the hotkey was pressed, since Ctrl+Alt does not activate the menu bar.
ja: Ctrl+Altではメニューバーが起動しないため、ホットキー押下時にCtrlが押されていた場合、Altはマスクされない。

source: Alt or Win is logically down when the hotkey is pressed.
ja: AltまたはWinは、ホットキーが押されると論理的にダウンします。

source: AltGr (alternate graph, or alternate graphic).
ja: AltGr（オルタネートグラフ、代替グラフィック）。

source: Backspace is always ignored if pressed in combination with a modifier key such as Ctrl (the logical modifier state is checked rather than the physical state).
ja: Backspaceは、Ctrlなどの修飾キーと組み合わせて押された場合、常に無視されます（物理的な状態ではなく、論理的な修飾の状態がチェックされます）。

source: Backspace is counted as producing text only when it acts as undo.
ja: Backspace、アンドゥとして機能する場合のみ、テキストを生成するものとしてカウントされます。

source: CapsLock (caps lock key)
ja: CapsLock（キャプスロックキー）

source: CapsLock (using SetCapsLockState is more reliable).
ja: CapsLock（SetCapsLockStateを使用するとより確実です）。

source: CapsLock generally affects remapped keys in the same way as normal keys.
ja: CapsLockは通常、通常のキーと同じようにリマップキーに影響します。

source: Ctrl (technical info:
ja: Ctrl（技術情報：

source: Ctrl (technical info: sends the neutral virtual key but the left scan code)
ja: Ctrl（技術情報：はニュートラルバーチャルキーを送信しますが、左のスキャンコード）

source: Ctrl+Pause or Ctrl+ScrollLock
ja: Ctrl+PauseまたはCtrl+ScrollLock

source: Del on keypad (this key and the following Numpad keys are used when NumLock is OFF)
ja: キーパッドのDel（NumLockがOFFのときは、このキーと以下のNumpadキーが使用されます）

source: End on keypad
ja: キーパッドでEnd

source: End on main keyboard
ja: メインキーボードでEnd

source: Enter on keypad
ja: キーパッドのEnter

source: Enter on the main keyboard
ja: メインキーボードでEnter

source: Home on keypad
ja: キーパッドでHome

source: Home on main keyboard
ja: メインキーボードでHome

source: Ins on keypad
ja: キーパッドのIns

source: Menu (invokes the right-click or context menu)
ja: Menu（右クリックメニューまたはコンテキストメニューを呼び出す）

source: NumLock (number lock key).
ja: NumLock（ナンバーロックキー）。

source: NumLock (see also:
ja: NumLock（参照：

source: NumLock (see also: SetNumLockState)
ja: NumLock（参照：SetNumLockState）

source: Pause or Ctrl+NumLock.
ja: PauseまたはCtrl+NumLock。

source: PgDn (page down key)
ja: PgDn（ページダウンキー）

source: PgDn on keypad
ja: キーパッドでPgDn

source: PgDn on main keyboard
ja: メインキーボードのPgDn

source: PgUp (page up key)
ja: PgUp（ページアップキー）

source: PgUp on keypad
ja: キーパッドでPgUp

source: PgUp on main keyboard
ja: メインキーボードでPgUp

source: PrtSc (print screen key)
ja: PrtSc（プリントスクリーンキー）

source: ScrollLock (scroll lock key).
ja: ScrollLock（スクロールロックキー）

source: ScrollLock (see also:
ja: ScrollLock（参照：

source: ScrollLock (see also: SetScrollLockState)
ja: ScrollLock（参照：SetScrollLockState）

source: Shift (technical info:
ja: Shift（技術情報：

source: Shift (technical info: sends the neutral virtual key but the left scan code)
ja: Shift（技術情報：はニュートラルバーチャルキーを送信しますが、左のスキャンコード）

source: Space (space bar)
ja: Space（スペースバー）

source: Space (this is only needed for spaces that appear either at the beginning or the end of the string to be sent -- ones in the middle can be literal spaces)
ja: Space（送信する文字列の先頭または末尾に現れるスペースにのみ必要で、途中にあるものはリテラルスペースでもよい）

source: Tab (tabulator key)
ja: Tab（タブキー）

source: Win (Windows logo key)
ja: Win（Windowsロゴキー）

source: Win (Windows logo key).
ja: Win （ウィンドウズロゴキー）。

source: Win is not masked if the most recent Win keydown was modified with Ctrl, Shift or Alt, since the Start Menu does not normally activate in those cases.
ja: WinキーがCtrl、Shift、Altで変更された場合、スタートメニューは通常起動しないので、Winはマスクされない。

source: ← (left arrow key)
ja: ←（左矢印キー）

source: ← (left arrow) on keypad
ja: キーパッドで←（左矢印）を押す

source: ← (left arrow) on main keyboard
ja: メインキーボードで←（左矢印）を押す

source: ↑ (up arrow key)
ja: ↑（上矢印キー）

source: ↑ (up arrow) on keypad
ja: キーパッドで↑（上矢印）

source: ↑ (up arrow) on main keyboard
ja: メインキーボードで↑（上矢印）

source: ↑, →, ↓, ←, PgUp, PgDn, Home, and End.
ja: ↑、→、↓、←、PgUp、PgDn、Home、End。

source: → (right arrow key)
ja: →（右矢印キー）

source: → (right arrow) on keypad
ja: キーパッドで→（右矢印

source: → (right arrow) on main keyboard
ja: メインキーボードで→（右矢印

source: ↓ (down arrow key)
ja: ↓（下矢印キー）

source: ↓ (down arrow) on keypad
ja: キーパッドで↓（下矢印）

source: ↓ (down arrow) on main keyboard
ja: メインキーボードで↓（下矢印）を押す

source: B would continue to send the "b" keystroke unless you remap it to something else as shown in the following example:
ja: Bは、次の例のように他のキーにリマップしない限り、「b」キーストロークを送信し続ける：

source: CapsLock will be restored to its former value if Send needed to change it temporarily for its operation.
ja: CapsLockは、Sendがその操作のために一時的に変更する必要があった場合、元の値に戻すことができます。

source: Ctrl, Alt, Win, and Shift.
ja: Ctrl, Alt, Win, および Shift.

source: $ may appear at the end of a pattern to require the match to occur at the very end of a line.
ja: $ は、行の末尾でマッチすることを要求するために、パターンの末尾に表示することができる。

source: &: Causes the address of the parameter list (a single integer) to be passed to Function instead of the individual parameters.
ja: &：個々のパラメータではなく、パラメータリストのアドレス（1つの整数）をFunctionに渡すようにします。

source: ( or ):
ja: ( または )：

source: ( or ): If an opening or closing parenthesis appears to the right of the initial opening parenthesis (except as a parameter of the Join option), the line is reinterpreted as an expression instead of the beginning of a continuation section.
ja: ( または )：最初の開始括弧の右側に開始括弧または閉じ括弧がある場合（Joinオプションのパラメータを除く）、その行は継続セクションの開始ではなく、式として再解釈される。

source: (expression)
ja: (表現)

source: (Unnamed numeric styles): Since styles other than the above are rarely used, they do not have names.
ja: (無名数字スタイル）：上記以外のスタイルはほとんど使用されないため、名称を付けない。

source: *: Wildcard.
ja: *：ワイルドカード。

source: * (asterisk):
ja: *（アスタリスク）：

source: * (asterisk): An ending character (e.g. Space, ., or Enter) is not required to trigger the hotstring.
ja: *（アスタリスク）：ホットストリングのトリガーには、Space、.、Enterなどのエンディングキャラクターは必要ありません。

source: *n (variation): Specify for n a number between 0 and 255 (inclusive) to indicate the allowed number of shades of variation in either direction for the intensity of the red, green, and blue components of each pixel's color.
ja: *n（バリエーション）：nには、各画素の色の赤、緑、青の各成分の強度が、どちらの方向にも変化する許容階調数を示す 0～255 の数値（包括）を指定します。

source: *IconN: To use an icon group other than the first one in the file, specify *Icon followed immediately by the number of the group.
ja: *IconN：ファイル内の先頭以外のアイコングループを使用する場合は、*Iconの後にグループの番号を続けて指定してください。

source: *TransN: This option makes it easier to find a match by specifying one color within the image that will match any color on the screen.
ja: *TransN：このオプションは、画面上のどの色とも一致するような色を画像内で1つ指定することで、一致する色を見つけやすくするものです。

source: *wn and *hn:
ja: *wnと*hn：

source: *wn and *hn: Width and height to which to scale the image (this width and height also determines which icon to load from a multi-icon .ICO file).
ja: *wnと*hn：画像を拡大縮小する幅と高さ（この幅と高さは、マルチアイコン.ICOファイルからどのアイコンを読み込むかも決定）。

source: + (plus): Cancels any previous -, otherwise has no effect.
ja: +（プラス）：それ以外の場合は、何の効果もなく、以前の-をキャンセルします。

source: - (minus): Removes any of the options following the -, up to the next +.
ja: -（マイナス）：-に続くオプションのうち、次の+まで削除します。

source: .Precision: A decimal integer which controls the maximum number of string characters, decimal places, or significant digits to output, depending on the output type.
ja: .Precision：出力タイプに応じて、出力する文字列の最大文字数、小数点以下の桁数、または有効桁数を制御する10進数の整数です。

source: 0. This License applies to any program or other work which contains a notice placed by the copyright holder saying it may be distributed under the terms of this General Public License.
ja: 0.本許諾書は、著作権者が本一般公衆利用許諾契約書の条項の下で頒布してよい旨の告知を 含むプログラムその他の著作物に適用される。

source: 0: Do not overwrite existing files.
ja: 0：既存ファイルを上書きしません。

source: 0 (false): Omit subsequently-executed lines from the history.
ja: 0 (false)：その後に実行された行は履歴に含めません。

source: 0 (false): The current thread will move on to the next statement(s) while the file is playing.
ja: 0 (false)：未設定または省略された場合、スクリプトの現在のスレッドは、ファイルの再生中に次のステートメントに移ります。

source: 1. You may copy and distribute verbatim copies of the Program's source code as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice and disclaimer of warranty; keep intact all the notices that refer to this License and to the absence of any warranty; and give any other recipients of the Program a copy of this License along with the Program.
ja: 1.ただし、各コピーに適切な著作権表示と保証の否認を目立つように 適切に掲載し、本許諾書と保証の不存在に言及するすべての表示をそのまま保持 し、『プログラム』のその他の受領者に『プログラム』と一緒に本許諾書のコ ピーを渡すことを条件とする。

source: 10. If you wish to incorporate parts of the Program into other free programs whose distribution conditions are different, write to the author to ask for permission.
ja: 10.プログラムの一部を、配布条件が異なる他のフリー・プログラムに組み込みたい場合は、作者に手紙を書いて許可を求めてください。

source: 11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.
ja: 11.本プログラムは無償でライセンスされているため、適用される法律で許可されている範囲において、本プログラムに対する保証はありません。

source: 12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
ja: 12.偶発的または結果的な損害は、そのようなホルダーまたは他の当事者がそのような損害の可能性について知らされていた場合でも、プログラムの使用または使用不能から生じる（データの損失やデータが不正確になること、またはあなたや第三者が被った損失、またはプログラムが他のプログラムと一緒に動作しないことを含むがこれに限定されない）。

source: 16: Prompt to Overwrite File
ja: 16：ファイルを上書きするかどうか確認します

source: 1: A button is provided that allows the user to create new folders.
ja: 1：新規にフォルダを作成するためのボタンを用意しました。

source: 1: A window's title must start with the specified WinTitle to be a match.
ja: 1：ウィンドウのタイトルは、指定されたWinTitleで始まらなければ一致しない。

source: 1: File Must Exist
ja: 1：ファイルが存在する必要がある

source: 1: Overwrite existing files.
ja: 1：既存ファイルを上書きします。
